import React from "react";

const Blogs = () => {
    return (
        <div className="container my-5">
            <div>
                <h3>Context Api কি কাজে লাগে?</h3>
                <p>
                    <b>উত্তরঃ</b>
                    <br />
                    রিয়াক্টে ডাটা প্যারেন্ট কম্পোনেন্ট থেকে চাইল্ড কম্পোনেন্টে
                    প্রপস হিসেবে পাস করতে হয়। একাধিক চাইল্ড বা চাইল্ড কম্পোনেন্ট
                    এর চাইল্ড কম্পোনেন্টে ডাটা প্রপস হিসেবে পাঠাতে হয়। এই সমস্যা
                    সমাধানের জন্যে কনটেক্সট এপিআই ব্যবহার করা হয়। কনটেক্সট এপিআই
                    ক্রিয়েট করে যে চাইল্ড গুলোতে ডাটা পাঠাতে চাই সে চাইল্ড গুলো
                    কনটেক্সট.প্রভাইডারের ভেতরে রেখে সেটাতে ভ্যালু সেট করে দেই।
                    এতে করে ওই সব চাউল্ড কম্পোনেন্ট সে ভ্যালু বা ডাটা এক্সেস
                    করতে পারে। তারপর কনটেক্সটি এক্সপোর্ট করার পর যে চাইল্ড
                    কম্পোনেন্টে সে ভ্যালু পেতে চাই সে কম্পোনেন্টে ইউজকনটেক্সটের
                    মাধ্যমে সেই কনটেক্সট ইমপোর্ট করে ভ্যালু পেয়ে যাই। যার ফলে
                    প্রপস ড্রিলিং করে ডাটা বা ভ্যালু পাস করতে হয় না।
                </p>
            </div>
            <div>
                <h3>Inline, Block এবং Inline-block এর মধ্যে পার্থক্য কি?</h3>
                <p>
                    <b>উত্তরঃ</b>
                    <br />
                    <b>Inline Elements:</b>
                    <br />
                    <li>Inline ইলিমেন্ট শুধুমাত্র প্রয়োজনীয় উইধ দখল করে। </li>
                    <li>Inline ইলিমেন্টে উইধ এবং হাইট সেট করা যায় না।</li>
                    <li>
                        Inline ইলিমেন্টের পাশে অন্য Inline ইলিমেন্ট বসতে পারে।{" "}
                    </li>
                    <li>Inline ইলিমেন্টে টপ এবং বটম মারজিন নেই</li>
                </p>
                <p>
                    <b>Block Elements:</b>
                    <li>
                        Block ইলিমেন্ট ফুল উইধ দখল করে যদি না উইধ সেট করে দেওয়া
                        হয়।
                    </li>
                    <li>Block ইলিমেন্টে সবদিকে মারজিন এবং পাডিং দেওয়া যায়।</li>
                    <li>Block ইলিমেন্টের পাশে অন্য ইলিমেন্ট বসতে পারে না।</li>
                </p>
                <p>
                    <b>Inline-block Elements:</b>
                    <br />
                    <li>Inline-block এর পাশে অন্য ইলিমেন্ট বস্তে পারে।</li>
                    <li>Inline-block ইলিমেন্টে হাইট এবং উইধ সেট করা যায়।</li>
                    <li>
                        Inline-block ইলিমেন্টে টপ এবং বটম মারজিন এবং পাডিং থাকে।
                    </li>
                </p>
            </div>
        </div>
    );
};

export default Blogs;
